# Задача 1. Провести дисперсионный анализ для определения того, есть ли различия среднего
# роста среди взрослых футболистов, хоккеистов и штангистов.
# Даны значения роста в трех группах случайно выбранных спортсменов:
# Футболисты: 173, 175, 180, 178, 177, 185, 183, 182.
# Хоккеисты: 177, 179, 180, 188, 177, 172, 171, 184, 180.
# Штангисты: 172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170.

import numpy as np
from scipy import stats


y1 = np.array([173, 175, 180, 178, 177, 185, 183, 182])
y2 = np.array([177, 179, 180, 188, 177, 172, 171, 184, 180])
y3 = np.array([172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170])

f = stats.f_oneway(y1, y2, y3)
print(f)

#F_onewayResult(statistic=5.500053450812596, pvalue=0.010482206918698693), pvalue < alfa, значит принимается значение альтернативной
# гпитизы, т.е. различия в росте футболистов, хоккеистов и штангистов есть.
# найдем между какиеми группами есть отличия с помощью теста Тьюки

from statsmodels.stats.multicomp import pairwise_tukeyhsd
import pandas as pd
df = pd.DataFrame({'score': [173, 175, 180, 178, 177, 185, 183, 182, 
                             177, 179, 180, 188, 177, 172, 171, 184,
                             172, 173, 169, 177, 166, 180, 178, 166],
                   'groupe': np.repeat(['Футболисты', 'Хоккеисты', 'Штангисты'], repeats=8)})

tykey = pairwise_tukeyhsd(endog= df['score'],
                          groups= df['groupe'],
                          alpha= 0.05)

print(tykey)

# ============================================================
#   group1     group2  meandiff p-adj   lower    upper  reject
# ------------------------------------------------------------
# Футболисты Хоккеисты   -0.625 0.9676  -7.0674  5.8174  False
# Футболисты Штангисты     -6.5 0.0477 -12.9424 -0.0576   True
#  Хоккеисты Штангисты   -5.875 0.0781 -12.3174  0.5674  False
# ------------------------------------------------------------

# раличие между футболистами и штангистами